#include <cstdio>
#ifndef F_H_
#define F_H_
#define SIZE 8
struct scan_info {
    char model[25]; // §ß§Ñ§Ú§Þ§Ö§ß§à§Ó§Ñ§ß§Ú§Ö §Þ§à§Õ§Ö§Ý§Ú 
    int price;      // §è§Ö§ß§Ñ 
    float x_size;       // §Ô§à§â§Ú§Ù§à§ß§ä§Ñ§Ý§î§ß§í§Û §â§Ñ§Ù§Þ§Ö§â §à§Ò§Ý§Ñ§ã§ä§Ú §ã§Ü§Ñ§ß§Ú§â§à§Ó§Ñ§ß§Ú§ñ
    float y_size;       // §Ó§Ö§â§ä§Ú§Ü§Ñ§Ý§î§ß§í§Û §â§Ñ§Ù§Þ§Ö§â §à§Ò§Ý§Ñ§ã§ä§Ú §ã§Ü§Ñ§ß§Ú§â§à§Ó§Ñ§ß§Ú§ñ
    int optr;       // §à§á§ä§Ú§é§Ö§ã§Ü§à§Ö §â§Ñ§Ù§â§Ö§ê§Ö§ß§Ú§Ö 
    int grey;       // §é§Ú§ã§Ý§à §Ô§â§Ñ§Õ§Ñ§è§Ú§Û §ã§Ö§â§à§Ô§à 
}s1;

struct scan_info1 {
    struct scan_info;
}s11;

void input(FILE* tf); // §ã§à§Ù§Õ§Ñ§ß§Ú§Ö §ß§à§Ó§à§Ô§à §æ§Ñ§Û§Ý§Ñ
void print(FILE* tf); // §á§â§à§ã§Þ§à§ä§â §æ§Ñ§Û§Ý§Ñ
void app(FILE* tf); // §Õ§à§Ò§Ñ§Ó§Ý§Ö§ß§Ú§Ö §Ó §æ§Ñ§Û§Ý
int zapros(FILE* tf);//§ã§à§â§ä§Ú§â§à§Ó§Ü§Ñ §á§à §à§Õ§ß§à§Þ§å §Ú§Ù §á§Ñ§â§Ñ§Þ§Ö§ä§â§à§Ó


#endif